Repository: halilibrahimavsar/torcav
Catalog: lib/l10n/arb/app_*.arb
Languages: de, ku, tr

# activeOperationsBlockedMsg
source: Active operations are blocked unless policy and allowlist conditions pass.
de: Aktive Operationen sind blockiert, bis Richtlinien und Zulassungslisten erfüllt sind.
ku: Operasyonên aktîf hatine astengkirin heta ku polîtîka û lîsteya destûrdayînê werin pejirandin.
tr: Etkin operasyonlar, politika ve izin listesi koşulları sağlanmadıkça engellenir.

source: Authorized Targets
de: Autorisierte Ziele
ku: Hedefên Destûrdayî
tr: Yetkili Hedefler

source: Add
de: Hinzufügen
ku: Zêde bike
tr: Ekle

# noTargetsAllowlisted
source: No targets allowlisted yet.
de: Noch keine Ziele zugelassen.
ku: Hîn ti hedef nehatine destûrdayîn.
tr: Henüz izin verilen hedef yok.

source: Hidden Network
de: Verstecktes Netzwerk
ku: Tora Veşartî
tr: Gizli Ağ

source: Remove
de: Entfernen
ku: Rake
tr: Kaldır

source: Security Timeline
de: Sicherheits-Zeitlinie
ku: Dema Ewlekariyê
tr: Güvenlik Zaman Çizelgesi

# noSecurityEvents
source: No security events yet.
de: Noch keine Sicherheitsereignisse.
ku: Hîn bûyerên ewlekariyê tune.
tr: Henüz güvenlik olayı yok.

source: Authorize Target
de: Ziel autorisieren
ku: Hedefê Destûr bide
tr: Hedefi Yetkilendir

source: Allow handshake capture
de: Handshake-Erfassung erlauben
ku: Destûr bide girtina destan (handshake)
tr: Yakalamaya izin ver (Handshake)

# allowActiveDefense
source: Allow active defense/deauth tests
de: Aktive Verteidigung/Deauth-Tests erlauben
ku: Destûr bide testên aktîf/deauth
tr: Aktif savunma/deauth testlerine izin ver

source: Cancel
de: Abbrechen
ku: Betal bike
tr: İptal

source: Save
de: Speichern
ku: Tomar bike
tr: Kaydet

source: Legal disclaimer accepted
de: Rechtlicher Hinweis akzeptiert
ku: Daxuyaniya yasayî hate qebûlkirin
tr: Yasal uyarı kabul edildi

# requiredForActiveOps
source: Required for active operations
de: Erforderlich für aktive Operationen
ku: Ji bo operasyonên aktîf pêwîst e
tr: Aktif operasyonlar için gerekli

source: Strict allowlist
de: Strenge Zulassungsliste
ku: Lîsteya destûrdayînê ya hişk
tr: Katı izin listesi

# blockActiveOpsUnknown
source: Block active operations for unknown targets
de: Aktive Operationen für unbekannte Ziele blockieren
ku: Operasyonên aktîf ji bo hedefên nenas asteng bike
tr: Bilinmeyen hedefler için aktif operasyonları engelle

# rateLimitActiveOps
source: Rate limit between active ops
de: Ratenbegrenzung zwischen aktiven Ops
ku: Sînora lezê navbera operasyonên aktîf
tr: Operasyonlar arası bekleme

# selectFromScanned
source: Select from scanned list
de: Aus Scan-Liste auswählen
ku: Ji lîsteya taranayî hilbijêre
tr: Tarananlardan seç

# settingsLanguage
source: Language
de: Sprache
ku: Ziman
tr: Dil

# settingsScanBehavior
source: Control default scan behavior, backend strategy, and safety posture.
de: Standard-Scanverhalten, Backend-Strategie und Sicherheitslage steuern.
ku: Tevgera taranê ya xwerû, stratejiya backend û rewşa ewlekariyê kontrol bike.
tr: Varsayılan tarama davranışı, arka uç stratejisi ve güvenlik durumu.

# settingsDefaultScanPasses
source: Default scan passes
de: Standard-Scan-Durchgänge
ku: Derbasbûnên taranê yên xwerû
tr: Varsayılan tarama geçişleri

# settingsMonitoringInterval
source: Monitoring interval (seconds)
de: Überwachungsintervall (Sekunden)
ku: Navbera şopandinê (saniye)
tr: İzleme aralığı (saniye)

# settingsBackendPreference
source: Default backend preference
de: Standard-Backend-Präferenz
ku: Terciha backend ya xwerû
tr: Varsayılan arka uç tercihi

# settingsIncludeHidden
source: Include hidden SSIDs by default
de: Versteckte SSIDs standardmäßig einbeziehen
ku: SSID-yên veşartî têxe nav
tr: Varsayılan olarak gizli SSID'leri dahil et

# settingsStrictSafety
source: Strict safety mode
de: Strenger Sicherheitsmodus
ku: Moda ewlekariya hişk
tr: Katı güvenlik modu

# settingsStrictSafetyDesc
source: Require consent + allowlist for active ops
de: Zustimmung + Zulassungsliste für aktive Ops erforderlich
ku: Ji bo operasyonên aktîf destûr û lîsteya destûrdayînê pêwîst e
tr: Aktif operasyonlar için onay + izin listesi gerektir

# navDashboard
source: Dashboard
tr: Panel

# navMore
source: More
de: Mehr
ku: Zêdetir
tr: Daha Fazla

# moreTitle
source: MORE
de: MEHR
ku: ZÊDETIR
tr: DAHA FAZLA

# sectionTools
source: TOOLS
de: WERKZEUGE
ku: AMÛR
tr: ARAÇLAR

# speedTestTitle
source: Speed Test & Monitoring
de: Geschwindigkeitstest & Überwachung
ku: Testa Lezê & Şopandin
tr: Hız Testi ve İzleme

# speedTestDesc
source: Bandwidth, latency, and anomaly tracking
de: Bandbreite, Latenz und Anomalie-Verfolgung
ku: Şopandina berfirehiya bandê, derengî û anomalî
tr: Bant genişliği, gecikme ve anomali takibi

# securityCenterTitle
source: Security Center
de: Sicherheitszentrum
ku: Navenda Ewlekariyê
tr: Güvenlik Merkezi

# securityCenterDesc
source: Risk scoring, allowlists, and policy controls
de: Risikobewertung, Zulassungslisten und Richtlinienkontrollen
ku: Puanlama rîskê, lîsteyên destûrdayînê û kontrolên polîtîkayê
tr: Risk puanlama, izin listeleri ve politika denetimleri

# reportsTitle
source: Reports
de: Berichte
ku: Raport
tr: Raporlar

# reportsDesc
source: Export scans as PDF, HTML, or JSON
de: Scans als PDF, HTML oder JSON exportieren
ku: Taranan wek PDF, HTML an JSON derxe
tr: Taramaları PDF, HTML veya JSON olarak dışa aktar

# sectionPreferences
source: PREFERENCES
de: EINSTELLUNGEN
ku: TERCIH
tr: TERCİHLER

# settingsTitle
source: Settings
de: Einstellungen
ku: Mîheng
tr: Ayarlar

# settingsDesc
source: Scan behavior, backends, and safety mode
de: Scanverhalten, Backends und Sicherheitsmodus
ku: Tevgera taranê, backend û moda ewlekariyê
tr: Tarama davranışı, arka uçlar ve güvenlik modu

# monitoringTitle
source: Monitoring
de: Überwachung
ku: Şopandin
tr: İzleme

# monitoringSubtitle
source: Bandwidth, anomaly detection, and heatmap streams.
de: Bandbreite, Anomalieerkennung und Heatmap-Streams.
ku: Berfirehiya bandê, tespîta anomalî û herikîna nexşeya germê.
tr: Bant genişliği, anomali tespiti ve ısı haritası akışları.

source: COMING SOON
de: DEMNÄCHST
ku: DÊ ZÛ BÊ
tr: ÇOK YAKINDA

source: Signal Trends
ku: Trendên Sînyalê
tr: Sinyal Eğilimleri

source: Topology & Mesh
de: Topologie & Mesh
ku: Topolojî & Mesh
tr: Topoloji ve Mesh

source: Anomaly Alerts
de: Anomalie-Warnungen
ku: Hîşyariyên Anomalî
tr: Anomali Uyarıları

# speedTestHeader
source: SPEED TEST
de: GESCHWINDIGKEITSTEST
ku: TESTA LEZÊ
tr: HIZ TESTİ

# testConnectionSpeed
source: Test your connection speed
de: Testen Sie Ihre Verbindungsgeschwindigkeit
ku: Leza girêdana xwe test bike
tr: Bağlantı hızınızı test edin

source: TESTING…
de: TESTEN…
ku: TEST DIKE…
tr: TEST EDİLİYOR…

source: TEST AGAIN
de: ERNEUT TESTEN
ku: DISA TEST BIKE
tr: TEKRAR TEST ET

source: START TEST
de: TEST STARTEN
ku: TESTÊ DEST PÊ BIKE
tr: TESTİ BAŞLAT

# phaseDownload
source: DOWNLOAD
ku: DAXISTIN
tr: İNDİRME

# phaseUpload
source: UPLOAD
ku: BARKIRIN
tr: YÜKLEME

# phaseDone
source: DONE
de: FERTIG
ku: TEMAM
tr: BİTTİ

# wifiScanTitle
source: WI-FI ANALYZER
de: WLAN-ANALYSATOR
ku: ANALÎZORÊ WI-FI
tr: WI-FI ANALİZÖRÜ

# scanSettingsTooltip
source: Scan settings
de: Scan-Einstellungen
ku: Mîhengên taranê
tr: Tarama ayarları

# channelRatingTooltip
source: Channel rating
de: Kanalbewertung
ku: Puanlama Kanalê
tr: Kanal puanlaması

# refreshScanTooltip
source: Refresh scan
de: Scan aktualisieren
ku: Taranê nû bike
tr: Taramayı yenile

source: Ready to scan
de: Bereit zum Scannen
ku: Amade ye ji bo taranê
tr: Taramaya hazır

# scanButton
source: Scan
de: Scannen
ku: Taran
tr: Tara

# scanSettingsTitle
source: Scan Settings
de: Scan-Einstellungen
ku: Mîhengên Taranê
tr: Tarama Ayarları

# passes
source: Passes: {count}
de: Durchgänge: {count}
ku: Derbasbûn: {count}
tr: Geçişler: {count}

source: Include hidden SSIDs
de: Versteckte SSIDs einbeziehen
ku: SSID-yên veşartî têxe nav
tr: Gizli SSID'leri dahil et

source: Backend preference
de: Backend-Präferenz
ku: Terciha backend
tr: Arka uç tercihi

source: Apply
de: Anwenden
ku: Pêk bîne
tr: Uygula

source: No signals detected
de: Keine Signale erkannt
ku: Sînyal nehatin dîtin
tr: Sinyal algılanmadı

source: Last Snapshot
de: Letzter Schnappschuss
ku: Wêneyê Dawî
tr: Son Anlık Görüntü

source: Band Analysis
de: Band-Analyse
ku: Analîza Bandê
tr: Bant Analizi

source: Networks ({count})
de: Netzwerke ({count})
ku: Tor ({count})
tr: Ağlar ({count})

source: Recommendation
de: Empfehlung
ku: Pêşniyar
tr: Öneri

# lanReconTitle
source: LAN RECON
de: LAN-ERKUNDUNG
tr: YEREL AĞ KEŞFİ

# scanFailed
source: SCAN FAILED: {message}
de: SCAN FEHLGESCHLAGEN: {message}
ku: TARAN TÊK ÇÛ: {message}
tr: TARAMA BAŞARISIZ: {message}

# readyToScanAllCaps
source: READY TO SCAN
de: BEREIT ZUM SCANNEN
ku: AMADE YE JI BO TARANÊ
tr: TARAMAYA HAZIR

# targetSubnet
source: Target subnet/IP
de: Ziel-Subnetz/IP
ku: Subnet/IP ya hedef
tr: Hedef Alt Ağ/IP

source: Profile
de: Profil
ku: Profil
tr: Profil

source: Method
de: Methode
ku: Metod
tr: Yöntem

# scanAllCaps
source: SCAN
de: SCANNEN
ku: TARAN
tr: TARA

source: NO HOSTS FOUND
de: KEINE HOSTS GEFUNDEN
ku: DIWAR NEHATIN DÎTIN
tr: CİHAZ BULUNAMADI

source: Unknown host
de: Unbekannter Host
ku: Diwarê nenas
tr: Bilinmeyen cihaz

# os
source: OS: {os}
tr: İS: {os}

# services
source: Services: {services}
de: Dienste: {services}
ku: Xizmet: {services}
tr: Servisler: {services}

# vuln
source: Vuln: {vuln}
de: Schwachstelle: {vuln}
tr: Zaafiyet: {vuln}

# reportsSubtitle
source: Export the latest scan session as JSON, HTML, or PDF.
de: Letzte Scan-Sitzung als JSON, HTML oder PDF exportieren.
ku: Danişîna taranê ya dawî wek JSON, HTML an PDF derxe.
tr: Son tarama oturumunu JSON, HTML veya PDF olarak dışa aktar.

# noSnapshotAvailable
source: No scan snapshot is available yet. Run a Wi-Fi scan first.
de: Noch kein Scan-Schnappschuss verfügbar. Führen Sie zuerst einen WLAN-Scan durch.
ku: Hîn wêneya taranê tune. Pêşî taranek Wi-Fi pêk bîne.
tr: Henüz tarama görüntüsü yok. Önce bir Wi-Fi taraması yapın.

# latestSnapshot
source: Latest snapshot: {count} networks via {backend}
de: Letzter Schnappschuss: {count} Netzwerke über {backend}
ku: Wêneyê dawî: {count} tor bi rêya {backend}
tr: Son görüntü: {backend} üzerinden {count} ağ

source: Export JSON
de: JSON exportieren
ku: JSON derxe
tr: JSON Dışa Aktar

source: Export HTML
de: HTML exportieren
ku: HTML derxe
tr: HTML Dışa Aktar

source: Export PDF
de: PDF exportieren
ku: PDF derxe
tr: PDF Dışa Aktar

source: Print PDF
de: PDF drucken
ku: PDF çap bike
tr: PDF Yazdır

# saveReportDialog
source: Save report
de: Bericht speichern
ku: Raportê tomar bike
tr: Raporu kaydet

# savePdfReportDialog
source: Save PDF report
de: PDF-Bericht speichern
ku: Raporta PDF tomar bike
tr: PDF raporunu kaydet

# savedToast
source: Saved: {path}
de: Gespeichert: {path}
ku: Tomar bû: {path}
tr: Kaydedildi: {path}

source: Handshake capture check
de: Handshake-Erfassungsprüfung
ku: Kontrola girtina destan
tr: Handshake yakalama kontrolü

source: Active defense readiness
de: Bereitschaft zur aktiven Verteidigung
ku: Amadebûna parastina aktîf
tr: Aktif savunma hazırlığı

source: Signal Graph
ku: Grafîka Sînyalan
tr: Sinyal Grafiği

source: RISK FACTORS
de: RISIKOFAKTOREN
ku: FAKTORÊN RÎSKÊ
tr: RİSK FAKTÖRLERİ

source: VULNERABILITIES
de: SCHWACHSTELLEN
ku: QELISÎ
tr: ZAFİYETLER

# recommendationLabel
source: RECOMMENDATION: {text}
de: EMPFEHLUNG: {text}
ku: PÊŞNIYAR: {text}
tr: ÖNERİ: {text}

# noVulnerabilities
source: No known vulnerabilities detected based on current scan data.
de: Keine bekannten Schwachstellen basierend auf aktuellen Scandaten erkannt.
ku: Li gorî daneyên taranê yên niha ti qelisî nehatin dîtin.
tr: Mevcut tarama verilerine göre bilinen zafiyet algılanmadı.

source: CHANNEL
de: KANAL
ku: KANAL
tr: KANAL

source: SECURITY
de: SICHERHEIT
ku: EWLEKARÎ
tr: GÜVENLİK

source: SIGNAL
ku: SÎNYAL
tr: SİNYAL

# channelRatingTitle
source: CHANNEL RATING
de: KANALBEWERTUNG
ku: PUANLAMA KANALÊ
tr: KANAL PUANLAMASI

# no24GhzChannels
source: No 2.4 GHz channels detected.
de: Keine 2,4-GHz-Kanäle erkannt.
ku: Kanalên 2.4 GHz nehatin dîtin.
tr: 2.4 GHz kanal algılanmadı.

# no5GhzChannels
source: No 5 GHz channels detected.
de: Keine 5-GHz-Kanäle erkannt.
ku: Kanalên 5 GHz nehatin dîtin.
tr: 5 GHz kanal algılanmadı.

# no6GhzChannels
source: No 6 GHz channels detected.
de: Keine 6-GHz-Kanäle erkannt.
tr: 6 GHz kanal algılanmadı.

source: RECOMMENDED CHANNEL
de: EMPFOHLENER KANAL
ku: KANALA PÊŞNIYARKIRÎ
tr: ÖNERİLEN KANAL

# channelInfo
source: Ch {channel} — {frequency} MHz
de: Kanal {channel} — {frequency} MHz
ku: Kan {channel} — {frequency} MHz
tr: Kan {channel} — {frequency} MHz

source: {band} Channels
de: {band}-Kanäle
ku: Kanalên {band}
tr: {band} Kanalları

# errorLabel
source: Error
de: Fehler
ku: Hata
tr: Hata

source: Loading…
de: Laden…
ku: Bardibe…
tr: Yükleniyor…

source: Analyzing…
de: Analysieren…
ku: Analîz dike…
tr: Analiz ediliyor…

source: Success
de: Erfolg
ku: Serkeftî
tr: Başarılı

source: OK
ku: Tamam
tr: Tamam

# scannedNetworksTitle
source: Scanned Networks
de: Gescannte Netzwerke
ku: Torên Taranayî
tr: Taranan Ağlar

source: No networks found.
de: Keine Netzwerke gefunden.
ku: Tor nehatin dîtin.
tr: Ağ bulunamadı.

source: Retry
de: Wiederholen
ku: Disa ceribandin
tr: Tekrar Dene

source: Known Networks
de: Bekannte Netzwerke
ku: Torên Nas
tr: Bilinen Ağlar

source: No known networks yet.
de: Noch keine bekannten Netzwerke.
ku: Hîn torên nas tune.
tr: Henüz bilinen ağ yok.

# opsLabel
source: Ops: {ops}
ku: Op: {ops}
tr: Op: {ops}

# navWifi
source: Wi-Fi
de: WLAN
